In [1]:
import pandas as pd

1. Pivotar um DataFrame Simples

In [2]:
df = pd.DataFrame({
    'data': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-02'],
    'categoria': ['A', 'A', 'B', 'B'],
    'valor': [10, 20, 30, 40]
})

In [3]:
df

         data categoria  valor
0  2023-01-01         A     10
1  2023-01-02         A     20
2  2023-01-01         B     30
3  2023-01-02         B     40

In [4]:
df.pivot(index='data',columns='categoria', values='valor')

categoria    A   B
data
2023-01-01  10  30
2023-01-02  20  40

2. Pivotar com múltiplos valores

In [5]:
df = pd.DataFrame({
    'data': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-02'],
    'categoria': ['A', 'A', 'B', 'B'],
    'valor': [10, 20, 30, 40],
    'quantidade': [1, 2, 3, 4]
})

In [7]:
df = df.pivot_table(index='data', columns='categoria', values=['valor','quantidade'], aggfunc='mean')
df

           quantidade      valor
categoria           A    B     A     B
data
2023-01-01        1.0  3.0  10.0  30.0
2023-01-02        2.0  4.0  20.0  40.0

3. Pivotar com Agregação de Função

In [8]:
df = pd.DataFrame({
    'data': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'categoria': ['A', 'B', 'A', 'B'],
    'valor': [10, 20, 30, 40]
})

In [10]:
df.pivot_table(index='data', columns='categoria', values='valor', aggfunc='sum')

categoria    A   B
data
2023-01-01  10  20
2023-01-02  30  40

4. Pivotar e Substituir NaN
Quando os dados pivotados tiverem valores ausentes (NaN), substitua-os por 0.

In [11]:
df = pd.DataFrame({
    'data': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-03'],
    'categoria': ['A', 'B', 'B', 'A'],
    'valor': [10, 20, 30, 40]
})

In [12]:
df.pivot_table(index='data', columns='categoria', values='valor', fill_value=0)

categoria      A     B
data
2023-01-01  10.0  30.0
2023-01-02   0.0  20.0
2023-01-03  40.0   0.0

5. Pivotar com Vários Índices
Agora, pivotar com múltiplos índices (por exemplo, 'data' e 'categoria'), de modo que os dados fiquem mais organizados.

In [13]:
df = pd.DataFrame({
    'data': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'categoria': ['A', 'B', 'A', 'B'],
    'valor': [10, 20, 30, 40]
})

In [14]:
df.pivot_table(index=['data', 'categoria'], values='valor')

                      valor
data       categoria
2023-01-01 A           10.0
           B           20.0
2023-01-02 A           30.0
           B           40.0

6. Pivotar com Dados de Vendas

In [15]:
df = pd.DataFrame({
    'mes': ['Jan', 'Jan', 'Feb', 'Feb'],
    'produto': ['A', 'B', 'A', 'B'],
    'vendas': [100, 200, 150, 250]
})

In [16]:
df.pivot_table(index='mes', columns='produto', values='vendas')

produto      A      B
mes
Feb      150.0  250.0
Jan      100.0  200.0

7. Pivotar e Contar Ocorrências

In [17]:
df = pd.DataFrame({
    'mes': ['Jan', 'Jan', 'Feb', 'Feb', 'Jan'],
    'produto': ['A', 'B', 'A', 'B', 'A'],
    'vendas': [100, 200, 150, 250, 120]
})

In [19]:
df.pivot_table(index='mes', columns='produto', values='vendas', aggfunc='count')

produto  A  B
mes
Feb      1  1
Jan      2  1

8. Pivotar com Valores Máximos

In [21]:
df = pd.DataFrame({
    'mes': ['Jan', 'Jan', 'Feb', 'Feb'],
    'produto': ['A', 'B', 'A', 'B'],
    'vendas': [100, 200, 150, 250]
})

In [23]:
df.pivot_table(index='mes', columns='produto', values='vendas', aggfunc='max')

produto    A    B
mes
Feb      150  250
Jan      100  200

9. Pivotar com Valores Mínimos

In [24]:
df = pd.DataFrame({
    'mes': ['Jan', 'Jan', 'Feb', 'Feb'],
    'produto': ['A', 'B', 'A', 'B'],
    'vendas': [100, 200, 150, 250]
})

In [26]:
df.pivot_table(index='mes', columns='produto', values='vendas', aggfunc=min)

C:\Users\gvara\AppData\Local\Temp\ipykernel_18520\484001008.py:1: FutureWarning: The provided callable <built-in function min> is currently using DataFrameGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.pivot_table(index='mes', columns='produto', values='vendas', aggfunc=min)

produto    A    B
mes
Feb      150  250
Jan      100  200

10. Pivotar e Ordenar

In [27]:
df = pd.DataFrame({
    'data': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-02'],
    'categoria': ['A', 'A', 'B', 'B'],
    'valor': [10, 20, 30, 40]
})

In [30]:
df = df.pivot_table(index='data', columns='categoria', values='valor')
df.sort_values(by='A', ascending=False)

categoria      A     B
data
2023-01-02  20.0  40.0
2023-01-01  10.0  30.0